/*
*********************************************************************************************************
*
*    模块名称 : 外部硬件中断配置
*    文件名称 : Leo_INT
*    版    本 : V1.0
*    说    明 : 外部硬件中断设置相关
*
*    修改记录 :
*        版本号    日期          作者     
*        V1.0    2019-01-14     Leo   
*
*    Copyright (C), 2018-2020, Department of Precision Instrument Engineering ,Tsinghua University  
*
*********************************************************************************************************
*/


#ifndef LEO_INT_H
#define LEO_INT_H

#include "Leo_Includes.h"


#ifdef __cplusplus
extern "C" {
#endif



/**********************************************************************************************
* 描  述 : 	外部按键控制存储 中断初始化
* 入  参 :	无	
* 返回值 : 	无
***********************************************************************************************/    
void vINTInital_SDCard(void);    
    
/**********************************************************************************************
* 描  述 : 	外部按键控制存储 中断 启动
* 入  参 :	无	
* 返回值 : 	无
***********************************************************************************************/ 
void vINTStart_SDCard(void);  


void vINTStart_MPU9255(void);
    
    
    
    

#ifdef __cplusplus
}
#endif


#endif 







