/******************** (C) COPYRIGHT 2018 王成宾********************
 * 文件名  ：Leo_nRF52_Time     
 * 平台    ：nRF52832 
 * 描述    ：通过计时器实现的时钟，用于所有传感器的时间同步  
 * 作者    ：王成宾
**********************************************************************/

#ifndef LEO_NRF52_TIME_H
#define LEO_NRF52_TIME_H


#include "Leo_nRF52_config.h"

#include "nrfx_timer.h"



#ifdef __cplusplus
extern "C" {
#endif
    
    
    
//@brief TIME0计时器 初始化
/*--------------------------------------------------------------------------*/
//<*参数说明:
//<*返回值说明:
/*--------------------------------------------------------------------------*/
uint8_t Leo_TIME1_Initial(void);    
    
    
//@brief TIME0计时器 开始工作
/*--------------------------------------------------------------------------*/
//<*参数说明:
//<*返回值说明:
/*--------------------------------------------------------------------------*/
void Leo_TIME1_Begin(void);    
    
    
    
    
    
    
    
    	
	
		
#ifdef __cplusplus
}
#endif


#endif  /* Leo_nRF52_Time.h */	   