/******************** (C) COPYRIGHT 2018 王成宾********************
 * 文件名  ：Leo_int     
 * 平台    ：nRF52832
 * 描述    ：中断定义及实现  
 * 作者    ：王成宾
**********************************************************************/



#ifndef LEO_INT_H
#define LEO_INT_H

#include "Leo_nRF52_config.h"
#include "nrf_drv_gpiote.h"



#ifdef __cplusplus
extern "C" {
#endif
	

/**********************************************************************************************
* 描  述 : 	Leo_INT_MPU9255_Initial函数
*          	MPU9255 中断初始化
* 入  参 :	无	
* 返回值 : 	
//<*		NRF_SUCCESS		读取成功 (0)
//<*		其它					读取失败    
***********************************************************************************************/ 
uint8_t Leo_INT_MPU9255_Initial(void);	

/**********************************************************************************************
* 描  述 : 	外部按键控制存储 中断初始化
* 入  参 :	无	
* 返回值 : 	NRF_SUCCESS		读取成功 (0)
//<*		其它					读取失败
***********************************************************************************************/ 
uint8_t Leo_INT_SDCard_Initial(void);	

/**********************************************************************************************
* 描  述 : 	GPS 1PPS秒脉冲 中断初始化 上升沿触发
* 入  参 :	无	
* 返回值 : 	NRF_SUCCESS		读取成功 (0)
//<*		其它					读取失败
***********************************************************************************************/ 
uint8_t Leo_INT_GPSPPS_Initial(void);    
    
	
#ifdef __cplusplus
}
#endif


#endif  /* LEO_INT_H.h */

