/******************** (C) COPYRIGHT 2018 王成宾********************
 * 文件名  ：Leo_nRF52_SDCard     
 * 平台    ：nRF52832
 * 描述    ：基于nRF52平台的 SDCard文件存储  
 * 作者    ：王成宾
**********************************************************************/

#ifndef LEO_NRF52_SDCARD_H
#define LEO_NRF52_SDCARD_H



#include "Leo_nRF52_config.h"

#include "ff.h"
#include "diskio_blkdev.h"
#include "nrf_block_dev_sdc.h"

#include "minmea.h"






#ifdef __cplusplus
extern "C" {
#endif

	
	
//@brief 基于nRF52对SDCard卡读写操作的初始化
/*--------------------------------------------------------------------------*/
//<*	参数说明:
//<*		
//<*	返回值说明:
//<*		FR_OK = 0,	其它失败
/*--------------------------------------------------------------------------*/
uint8_t Leo_nRF52_SDCard_Initial(void);


//@brief 基于nRF52 往 SDCard卡 内写入数据 
/*--------------------------------------------------------------------------*/
//<*	参数说明:
//<*	返回值说明:
//<*		FR_OK = 0,	其它失败
/*--------------------------------------------------------------------------*/
uint8_t Leo_nRF52_SDCard_SaveData(uint8_t* mbuffer,UINT mLength);    
    
    
    
//    
//    
////@brief 基于nRF52 往 SDCard卡 内写入数据
///*--------------------------------------------------------------------------*/
////<*	参数说明:
////<*	返回值说明:
////<*		FR_OK = 0,	其它失败
///*--------------------------------------------------------------------------*/
//FRESULT Leo_nRF52_SDCard_IMUSave(void);	

////@brief 基于nRF52 往 SDCard卡 内写入数据 GPS数据
///*--------------------------------------------------------------------------*/
////<*	参数说明:
////<*	返回值说明:
////<*		FR_OK = 0,	其它失败
///*--------------------------------------------------------------------------*/
//FRESULT Leo_nRF52_SDCard_GPSSave(void);	

    
    
//@brief 基于nRF52 SDCard卡 操作完成后，关闭文件
/*--------------------------------------------------------------------------*/
//<*	参数说明:
//<*	返回值说明:
//<*		FR_OK = 0,	其它失败
/*--------------------------------------------------------------------------*/
uint8_t Leo_nRF52_SDCard_FileClose(void);		

	

	
		
#ifdef __cplusplus
}
#endif


#endif  /* Leo_nRF52_SDCard.h */			
	
