/*
*********************************************************************************************************
*
*    模块名称 : GPS接收
*    文件名称 : Leo_INT
*    版    本 : V1.0
*    说    明 : GPS数据接收解析相关
*
*    修改记录 :
*        版本号    日期          作者     
*        V1.0    2019-01-19     Leo   
*
*    Copyright (C), 2018-2020, Department of Precision Instrument Engineering ,Tsinghua University  
*
*********************************************************************************************************
*/


#ifndef LEO_GPS_H
#define LEO_GPS_H

#include "Leo_Includes.h"


#ifdef __cplusplus
extern "C" {
#endif

    

//@brief GPS数据缓存区结构体定义
/*--------------------------------------------------------------------------*/
struct Leo_gps_buffer{
    int8_t      buffer[LEO_GPS_BUFFER_MAXLENGTH];       //GPS串口数据存储缓存区  char字符
    int8_t*     pSave;                                  //缓存区中当前存储的位置
    int8_t*     pLoad;                                  //读取缓存区的位置
    int8_t*     pStart;                                 //缓存区的起始地址
    int8_t*     pEnd;                                   //缓存区的末尾地址
    uint16_t    Number;                                 //当前缓存区内存储的字符个数
};
    
      
 
/*-----------------------------------------------------------------------*/
/* GPS串口通信 初始化                                                     */
/*-----------------------------------------------------------------------*/
uint8_t ucGPS_INTUART(void);

/*-----------------------------------------------------------------------*/
/* 对存入G_GPS_Sentence内的完整GPS语句 进行解析                            */
/*-----------------------------------------------------------------------*/
uint8_t ucGPS_Decoade(void);
        
    
    
    
    
    
    
#ifdef __cplusplus
}
#endif


#endif 